#### SystemsAnalysisReportStyle Enumeration

---

|  |
| --- |
| See Also |

The report style of systems analysis.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public enum SystemsAnalysisReportStyle ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration SystemsAnalysisReportStyle ``` |

| Visual C++ |
| --- |
| ``` public enum class SystemsAnalysisReportStyle ``` |

# Members

| Member name | Description |
| --- | --- |
| Detailed | The detailed report style. |
| Loads | The loads report style. |

# See Also

Autodesk.Revit.DB.Analysis Namespace